# CannotCopyBetweenFamilyAndProjectCorruption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyBetweenFamilyAndProjectCorruption Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy between Family and Project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyBetweenFamilyAndProjectCorruption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyBetweenFamilyAndProjectCorruption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyBetweenFamilyAndProjectCorruption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace